Revit 2026 API

# ImageExportOptionsZoomType Property

---

The zoom type, which defines how the image size is determined.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ZoomFitType ZoomType { get; set; }
```
```vb
Public Property ZoomType As ZoomFitType
	Get
	Set
```
```cpp
public:
property ZoomFitType ZoomType {
	ZoomFitType get ();
	void set (ZoomFitType value);
}
```
```fsharp
member ZoomType : ZoomFitType with get, set
```

#### Property Value

ZoomFitType

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

The default is FitToPage.

#### Reference

ImageExportOptions Class

Autodesk.Revit.DB Namespace